var local_database = [{
    date: "Nov 10 2018",
    title: "光棍节系列",
    imgSrc: "/images/post/crab.png",
    avatar: "/images/avatar/1.png",
    content: "今天你们缺灯泡吗？坐着吃饭不说话超亮的那种",
    reading: "112",
    collection: "96",
    headImgSrc: "/images/post/crab.png",
    author: "白团子",
    dateTime: "2小时前",
    detail: "曾经曾经，11月11日对于单身汪们来说，是个多么万念俱灰的日子。这是一年一度唯一跟单身狗有关的日子——光！棍！节！就那些平时设么节日都没啥表示的朋友，突然不远万里、百忙之中也要发短信祝你光棍节快乐。呵呵。我手里的大刀根！本！无！法！容！忍！过了一年情人节啊、七夕节啊这种跟自己毫无关系的节日，就连圣诞节都必须要忍受大街小巷飘满了情侣亲昵的味道……从来都只靠到超市捏巧克力，买电影票只买单号来过节的表示，自从电影院不给跳号买票，买两张票必须连坐之后，我就拒绝进电影院了。你不用知道为什么。也不用知道为什么不能跳号买。但是！！BUT！！！这一切都被一个伟大的人物改变了！他，单身狗救星，有妇之夫/有夫之妇的克星——马云。自从他凭借一己之力将光棍节生生扭转成了“双十一购物狂欢节”以后，单身狗们再也不用担心那些有的没的都要发短信祝一下光棍节快乐的混账们再来骚扰了。毕竟要不都忙着在购物车里加加加，要不就忙着改自己对象手里那张信用卡的密码的，就哪有空捏~~嚯嚯嚯嚯嚯嚯嚯嚯马云爸爸干的漂亮！",
    postId: 0,
    music: {
      url: "http://ws.stream.qqmusic.qq.com/C100003507bR0gDKBm.m4a?fromtag=38",
      title: "夜夜夜夜-齐秦",
      coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000001TEc6V0kjpVC.jpg?max_age=2592000"
    }
  },
  {
    title: "相聚中秋，有你就是团圆",
    content: "月圆人更圆，中秋节以月之圆兆人之团圆，为寄托思念故乡，思念亲人之情，祈盼丰收、幸福，成为丰富多彩、弥足珍贵的文化遗产。",
    imgSrc: "/images/post/bl.png",
    reading: 62,
    detail: " 中秋习俗，祭月，赏月，拜月。每逢中秋来临，赏月谈月便成为人们久谈不衰的话题。一家人围坐在一起，欣赏皓月当空的美景仍是中秋佳节必不可少的活动之一。猜谜，每逢中秋来临，赏月谈月便成为人们久谈不衰的话题。一家人围坐在一起，欣赏皓月当空的美景仍是中秋佳节必不可少的活动之一。最具科学幻想的中秋诗词，木兰花慢，快上西楼，怕天放、浮云遮月。但唤取、玉纤横笛，一声吹裂。谁做冰壶浮世界，最怜玉斧修时节。问常娥、孤冷有愁无。应华发。八月十五月正圆，中秋月饼香又甜，八月，宫中赏秋海棠、玉簪花。自初一日起，即有卖月饼者，至十五日，家家供奉月饼、瓜果。如有剩月饼，乃整收于干燥风凉之处，至岁暮分用之，曰团圆饼也。 ",
    collection: 92,
    dateTime: "24小时前",
    headImgSrc: "/images/post/bl.png",
    author: "玉兔",
    date: "Sep 13 2018",
    avatar: "/images/avatar/1.png",
    postId: 1,
    music: {
      url: "http://ws.stream.qqmusic.qq.com/C100003GdCmG4NkEOR.m4a?fromtag=38",
      title: "鬼迷心窍-李宗盛",
      coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000002xOmp62kqSic.jpg?max_age=2592000"
    }
  },
  {
    //按住alt + shift + F 可以格式化代码样式
    title: "当我们在谈论经济学时，我们在谈论什么?",
    content: "引言在我跟学生课后交流时，以及我在知乎上阅读有关“经济”问题的论题时，经常会遇到这样的情况：...",
    detail: "1 引言\n\n在我跟学生课后交流时，以及我在知乎上阅读有关“经济”问题的论题时，经常会遇到这样的情况：有些人套用“经济理论“的知识去解释现实中发生的经济事件，结果发现很多事情讲不通，或者发现”理论告诉我们的“与现实发生的是相反的。也有学生经常跟我说：经济学有什么用？为了说明这个，我经常从两个方面来进行解释，尝试用我个人所擅长的解决问题的视角和他们能够听懂的方法来说明经济学是什么，它的作用边界在哪里：\r\n\n2 ”简笔素描“与”油画肖像“我们给人画肖像画，可以用简笔素描，也可以用油画肖像。油画肖像可以在最大程度上保存了人物的各方面的细节和特点，而简笔素描则忽略了很多细节。尽管简笔素描忽略了人物的许多细节，但我们仍旧能够很容易的认出画中的人物是谁。为什么？因为这种方法保留了人物最显著的特征，以至于我们可以忽略其次要特征而对人物做出判定。\n\n2.1 ”简笔素描“对于绝大多数的非经济学专业大众而言（经济学相关专业硕士学历以上），人们所接触到的经济学都是初级微观经济学。所谓的初级微观经济学，对于经济问题的”画法“就是一种”简笔素描“。比如初级微观经济学教材中广为使用的这种一元一次需求函数：y=bx+a，需求量的唯一变量是产品价格。但仅凭直觉我们就可以断言，现实中影响需求量的因素绝不止价格这一种，因此我们可以认为这个模型对经济问题的描述是失真的。然而但这种失真却是必要的和有意义的，其意义在与它利于揭示价格对于需求的影响，而不在于否定影响需求的其他因素——",
    imgSrc: "/images/post/sls.jpg",
    headImgSrc: "/images/post/sls.jpg",
    reading: 62,
    collection: 92,
    author: "知乎",
    date: "Nov 12 2018",
    dateTime: "三天前",
    avatar: "/images/avatar/3.png",
    postId: 2,
    music: {
      url: "http://ws.stream.qqmusic.qq.com/C100004HLusI2lLjZy.m4a?fromtag=38",
      title: "女儿情-万晓利",
      coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000004Wv5BO30pPc0.jpg?max_age=2592000"
    }
  },
  {
    title: "无花无酒过清明，兴味萧然似野僧",
    content: "无花无酒过清明，兴味萧然似野僧。昨日邻家乞新火，晓窗分与读书灯。",
    imgSrc: "/images/post/xiaolong.jpg",
    reading: 102,
    detail: "《清明》是北宋诗人王禹偁创作的一首七言绝句。这首诗写作者在无花无酒，孤独一人，萧然无味的清明节时，从邻家乞来新火，作者却依然在穷困之中专心苦学，表现了寒士过清明时的凄凉及独特的过节方法，那么我们是怎样过清明节的呢？清明节又吃些什么呢？吃青团子，相传百五禁烟厨，红藕青糰各祭先，这首《吴门竹枝词》诗说的就是人们在清明节吃冷食青团，并用红藕、青团祭祀祖先。清明时节，江南一带有吃青团子的风俗习惯。青团，又叫艾团，是一种用草头汁做成的绿色糕团，有的是採用青艾，有的以雀麦草汁和糯米一起舂合，使青汁和米粉相互融合，团坯制好后，然后包上豆沙、枣泥等馅料，用芦叶垫底，将它们入笼蒸熟。蒸熟出笼，时用毛刷将熟菜油均匀地刷在糰子的表面，所以青糰碧青油绿，糯韧绵软，甘甜细腻，清香爽口，从色彩到口感都有着春天的气味，是清明与寒食节时江南一带人用来祭祀祖先必备食品。据考证，青糰之称大约始於唐代，至今每逢清明，江南几乎家家户户蒸青糰，虽然青糰流传千百年形制未变，但现在人们更多的是应令尝新，青糰作為祭祀的功能日益淡化。北京近些年清明节前应时售卖青糰的也渐多，南味糕点铺或者超市都见有售。吃馓子，我国南北各地清明节有吃馓子的食俗。馓子为一油炸食品，香脆精美，古时叫寒具。寒食节禁火寒食的风俗在我国大部分地区已不流行，但与这个节日有关的馓子却深受世人的喜爱。现在流行于汉族地区的馓子有南北方的差异：北方馓子大方洒脱，以麦面为主料; 南方馓子精巧细致，多以米面为主料。在少数民族地区，馓子的品种繁多，风味各异，尤以维吾尔族、东乡族和纳西族以及宁夏回族的馓子最为有名。 吃鸡蛋，在我国一些地方，清明吃鸡蛋，就如同端午节吃粽子、中秋吃月饼一样重要。民间习俗认为清明节吃个鸡蛋，一整年都有好身体。据相关专家介绍，清明吃鸡蛋习俗，已经有几千年的历史了。专家称，吃鸡蛋，是源于古代的上祀节。人们为婚育求子，将各种禽蛋如鸡蛋、鸭蛋、鸟蛋等煮熟并涂上各种颜色，称五彩蛋，他们来到河边把五彩蛋投到河里，顺水冲下，等在下游的人争捞、剥皮而食，食后便可孕育。现在清明节吃鸡蛋象征圆圆满满。在农村的一些地区，还有儿童之间撞鸡蛋的习俗。倘若要探究清明节里吃鸡蛋、撞鸡蛋的象征意义，其中应该还寄寓着人们对于生命、生育的敬畏与崇信之情。",
    collection: 92,
    dateTime: "4小时前",
    headImgSrc: "/images/post/xiaolong.jpg",
    author: "牧童",
    date: "Apr 5 2019",
    avatar: "/images/avatar/5.png",
    postId: 3,
    music: {
      url: "http://ws.stream.qqmusic.qq.com/C100002mWVx72p8Ugp.m4a?fromtag=38",
      title: "恋恋风尘-老狼",
      coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000001VaXQX1Z1Imq.jpg?max_age=2592000",
    }
  },
  {
    title: "青春不散场，今晚我有酒，你有空吗？",
    content: "青春就像一杯酒，酸甜苦辣而回味无穷。成长也如一杯酒，喜怒哀乐而后知醇熟。当世界杯再度开启，那些彻夜狂欢的记忆亦翻涌而起。即便酷暑炎炎，也难抵年轻的热情。这一回，劲酒冰饮全新亮相，看我们如何花样演绎，专属青春的潇洒与激情。",
    imgSrc: "/images/post/vr.png",
    reading: 102,
    detail: "热血青春岁月里，总有几场世界杯的身影。四瓶冰镇劲酒，一盆小龙虾，就是学生时代的狂欢标配。光阴荏苒，昔日好友早已天南地北，再度聚首，还是四瓶冰镇劲酒，一盆再熟悉不过的小龙虾，喜爱的球星早已退役，却丝毫不影响大家的热情。又像当年般围坐在一起，为进球喝彩干杯，所有的烦恼在此刻烟消云散，熟悉的醇香不禁让人回忆从前：曾经追过的女孩，一起逃过的高数课......细数往事，仿佛又回到那段青葱岁月。还好，即便大家各奔东西，却依旧有着一样的默契。四杯带着回忆的冰镇劲酒，就是四个人的桃园结义。自我奋斗，坚定梦想勇敢拼搏，成长总要告别青涩，理想总要面对现实。当家人的不理解与经济的负担接踵而至，热血青年在决定的分岔路口开始慌了手脚。四年前的世界杯，还是和兄弟一同喝酒各抒壮志的日子。大家都有崇拜的球星，每场胜利，都像在上演一次精神洗礼，那时的大家也互相拍肩鼓劲“就是因为年轻，抓紧去尝试，才不会空留遗憾”；而今年的世界杯，却只能一人独饮，万千委屈咽下肚，与瞬间的冰凉一同袭来的，是如酒般灼热的回忆，当年看着他们霸气扳平，绝杀对手， 即使当年的英雄早已退役，那份精神却难以忘记。这一刻，你突然明白了奋斗的意义，有个声音在告诉你：听从自己的内心，勇敢去追吧！原来，即便成功的光辉短暂，但追求梦想的意义却绵长。奋斗之路难免困难重重，沮丧时闷两口，那份灼热将让你看清为梦想拼搏的意义",
    collection: 26,
    dateTime: "24小时前",
    headImgSrc: "/images/post/vr.png",
    author: "白衣翩翩",
    date: "Jun 06 2019",
    avatar: "/images/avatar/3.png",
    postId: 4,
    music: {
      url: "http://ws.stream.qqmusic.qq.com/C100000Zn0vS4fKKo8.m4a?fromtag=38",
      title: "沉默是金-张国荣",
      coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000003at0mJ2YrR2H.jpg?max_age=2592000"
    }
  },
  {
    title: "重阳佳节，千言万语，不如真情陪伴",
    content: "重阳节，又称重九节、晒秋节、“踏秋”，中国传统节日。庆祝重阳节一般会包括出游赏秋、登高远眺、观赏菊花、遍插茱萸、吃重阳糕、饮菊花酒等活动。每年的农历九月初九日，与除夕、清明节、中元节三节统称中国传统四大祭祖的节日。",
    imgSrc: "/images/iqiyi.png",
    reading: 96,
    detail: "赏菊并饮菊花酒。重阳节正是一年的金秋时节，菊花盛开，据传赏菊及饮菊花酒，起源于晋朝大诗人陶渊明。陶渊明以隐居出名，以诗出名，以酒出名，也以爱菊出名；后人效之，遂有重阳赏菊之俗。旧时文人士大夫，还将赏菊与宴饮结合，以求和陶渊明更接近。北宋京师开封，重阳赏菊之风盛行，当时的菊花就有很多品种，千姿百态。民间还把农历九月称为“菊月”，在菊花傲霜怒放的重阳节里，观赏菊花成了节日的一项重要内容。清代以后，赏菊之习尤为昌盛，且不限于九月九日，但仍然是重阳节前后最为繁盛。插茱萸和簪菊花。重阳节插茱萸的风俗，在唐代就已经很普遍。古人认为在重阳节这一天插茱萸可以避难消灾；或佩带于臂，或作香袋把茱萸放在里面佩带，还有插在头上的。大多是妇女、儿童佩带，有些地方，男子也佩带。重阳节佩茱萸，在晋代葛洪《西经杂记》中就有记载。除了佩带茱萸，人们也有头戴菊花的。唐代就已经如此，历代盛行。清代，北京重阳节的习俗是把菊花枝叶贴在门窗上，“解除凶秽，以招吉祥”。这是头上簪菊的变俗。宋代，还有将彩缯剪成茱萸、菊花来相赠佩带的。登高的由来。南朝梁人吴均之《续齐谐记》记载东汉时，汝南县里有一个叫桓景的人，他所住的地方突然发生大瘟疫，桓景的父母也因此病死，所以他到东南山拜师学艺，仙人费长房给桓景一把降妖青龙剑。桓景早起晚睡，披星戴月，勤学苦练。一日，费长房说：“九月九日，瘟魔又要来，你可以回去除害。”并且给了他茱萸叶子一包，菊花酒一瓶，让他家乡父老登高避祸。九月九那天，他领着妻子儿女、乡亲父老登上了附近的一座山。把茱萸叶分给大家随身带上，瘟魔则不敢近身。又把菊花酒倒出来，每人喝了一口，避免染瘟疫。他和瘟魔搏斗，最后杀死了瘟魔。 汝河两岸的百姓，就把九月九登高避祸、桓景剑刺瘟魔故事一直传到现在。从那时起，人们就过起重阳节来，有了重九登高的风俗。",
    collection: 26,
    dateTime: "21小时前",
    headImgSrc: "/images/iqiyi.png",
    author: "千里",
    date: "Oct 07 2018",
    avatar: "/images/avatar/5.png",
    postId: 5,
    music: {
      url: "http://ws.stream.qqmusic.qq.com/C100002I8eGJ28BI17.m4a?fromtag=38",
      title: "朋友-谭咏麟",
      coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000004eGsCN3SUheO.jpg?max_age=2592000"
    }
  },
]

module.exports = {
  postList: local_database
}